InformationRegisters/ПулКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПулКодовМаркировкиСУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЭмиссииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаЭмиссию</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХешСуммаКодаМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Криптохвост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоступления</Name>
					<Comment>0 - наша эмиссия, 1 - при приемке приходного ордера, 2 - из ЭДО при создании инвойса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипУпаковкиМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВложенныеКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерОборудованияМаркировка/Ext/Module.bsl
Функция ЭтоШтрихКодМаркировки(ПромШтрихКод, РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ = Ложь, ВведеноВРучную = Истина) Экспорт 
	
	СтруктураШтрихКодаМаркировки = Новый Структура;
	СтруктураШтрихКодаМаркировки.Вставить("Результат", Ложь);
	СтруктураШтрихКодаМаркировки.Вставить("ТекстОшибки", "");
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКод" , ПромШтрихКод);
	
	Если (Лев(ПромШтрихКод , 2) = "01" И Сред(ПромШтрихКод,17,2) = "21") Или (Лев(ПромШтрихКод , 4) = "(01)" И Сред(ПромШтрихКод,19,4) = "(21)") Тогда
		
		//+Марков И. 27.02.2026 #UT10-5667
		Если РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ Тогда
			
			ЧастиКода = ПолучитьПозицииGS(ПромШтрихКод, Символ(29), ВведеноВРучную);				
			СтруктураШтрихКодаМаркировки = РазложитьКодМаркировки(ПромШтрихКод, ЧастиКода);
						
			Если ЗначениеЗаполнено(СтруктураШтрихКодаМаркировки.ТекстОшибки) Тогда
				Возврат СтруктураШтрихКодаМаркировки;	
			КонецЕсли;	
			
		Иначе
			
			СтруктураШтрихКодаМаркировки.Вставить("Результат", Истина); 
			
			ПростойВидШтрихКода = Лев(ПромШтрихКод , 2) = "01";                
			
			//Получаем оба вида штрих-кода
			
			//+Сёмин Р.И. 24.04.2026 #UT10-5814
			//Если ПростойВидШтрихКода Тогда
			//	
			//	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , Лев(ПромШтрихКод , 31));
			//	ПромШтрихКодПолный = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
			//	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , ПромШтрихКодПолный);
			//	
			//Иначе 
			//	
			//	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , Лев(ПромШтрихКод , 35));
			//	ПромШтрихКодКраткий =  "01" + Сред(ПромШтрихКод,5,14) + "21" + Сред(ПромШтрихКод , 23 , 13);
			//	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , ПромШтрихКодКраткий);
			//	
			//КонецЕсли;
			
			Если Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Получить() Тогда
				
				ЗаполнитьКраткийПолныйКодМаркировки(ПромШтрихКод, СтруктураШтрихКодаМаркировки, ПростойВидШтрихКода);
				
				Если СтруктураШтрихКодаМаркировки.Результат = Ложь Тогда
					Возврат СтруктураШтрихКодаМаркировки;
				КонецЕсли;
				
			Иначе
				
				Если ПростойВидШтрихКода Тогда
					
					СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , Лев(ПромШтрихКод , 31));
					ПромШтрихКодПолный = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
					СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , ПромШтрихКодПолный);
					
				Иначе 
					
					СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный"  , Лев(ПромШтрихКод , 35));
					ПромШтрихКодКраткий =  "01" + Сред(ПромШтрихКод,5,14) + "21" + Сред(ПромШтрихКод , 23 , 13);
					СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий" , ПромШтрихКодКраткий);
					
				КонецЕсли;
				
			КонецЕсли;
			//-Сёмин Р.И. 24.04.2026 #UT10-5814
			
			// Выделяем GTIN
			СтруктураШтрихКодаМаркировки.Вставить("GTIN"                , Сред(СтруктураШтрихКодаМаркировки.ШтрихКодКраткий , 3 , 14));
			
		КонецЕсли;
		//-Марков И. 27.02.2026 #UT10-5667
		
		
	Иначе
		
		СтруктураШтрихКодаМаркировки.Вставить("Результат" , Ложь); 
		Возврат СтруктураШтрихКодаМаркировки;
		
	КонецЕсли;
	
	ЕстьВСправочнике = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки" , СтруктураШтрихКодаМаркировки.ШтрихКодКраткий);
	
	Если ЕстьВСправочнике.Пустая() Тогда
		ЕстьВСправочнике = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки" , СтруктураШтрихКодаМаркировки.ШтрихКодПолный);
	КонецЕсли;
	
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодНоменклатуры", ЕстьВСправочнике); 
	//*******
	
	// Ищем в регистре ПулКодовМаркировкиСУЗ
	СтруктураШтрихКодаМаркировки.Вставить("ЧужойКИЗ"             , Истина);
	СтруктураШтрихКодаМаркировки.Вставить("ПолныйКодМаркировки"  , Новый ХранилищеЗначения(Неопределено));
	СтруктураШтрихКодаМаркировки.Вставить("Номенклатура"         , Справочники.Номенклатура.ПустаяСсылка());
	
	ЗапросШтрихКодаВРегистре = Новый Запрос;
	ЗапросШтрихКодаВРегистре.Текст =
	"ВЫБРАТЬ
	|	ПулКодовМаркировкиСУЗ.Номенклатура,
	|	ПулКодовМаркировкиСУЗ.ПолныйКодМаркировки
	|ИЗ
	|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
	|ГДЕ
	|	ПулКодовМаркировкиСУЗ.КодМаркировки В(&СписокКодовМаркировки)";
	
	СписокКодовМаркировки = Новый СписокЗначений;
	СписокКодовМаркировки.Добавить(СтруктураШтрихКодаМаркировки.ШтрихКодКраткий);
	СписокКодовМаркировки.Добавить(СтруктураШтрихКодаМаркировки.ШтрихКодПолный);
	ЗапросШтрихКодаВРегистре.УстановитьПараметр("СписокКодовМаркировки", СписокКодовМаркировки);
	
	РезультатЗапросаШтрихКодаВРегистре = ЗапросШтрихКодаВРегистре.Выполнить().Выгрузить();
	
	СтруктураШтрихКодаМаркировки.ЧужойКИЗ = РезультатЗапросаШтрихКодаВРегистре.Количество() = 0;
	
	Если Не РезультатЗапросаШтрихКодаВРегистре.Количество() = 0 Тогда
		
		СтруктураШтрихКодаМаркировки.Номенклатура        = РезультатЗапросаШтрихКодаВРегистре[0].Номенклатура;
		СтруктураШтрихКодаМаркировки.ПолныйКодМаркировки = РезультатЗапросаШтрихКодаВРегистре[0].ПолныйКодМаркировки;
		
	Иначе
		//+Белов А. 16.02.2026 # 
		ЗаписьЖурналаРегистрации("МенеджерОборудованияМаркировка.ЭтоШтрихКодМаркировки", УровеньЖурналаРегистрации.Информация,,, "Получен не наш ШК: " + СтрЗаменить(ПромШтрихКод, Символ(29) , "<GS>"));
		
		СтруктураШтрихКодаМаркировки.ПолныйКодМаркировки = Новый ХранилищеЗначения(СтруктураШтрихКодаМаркировки.Штрихкод); 
		
		Если ЗначениеЗаполнено(СтруктураШтрихКодаМаркировки.ШтрихКодНоменклатуры) 
			И Не ЗначениеЗаполнено(СтруктураШтрихКодаМаркировки.ШтрихКодНоменклатуры.ПолныйКодМаркировки.Получить()) Тогда
			
			ОбъектШК = СтруктураШтрихКодаМаркировки.ШтрихКодноменклатуры.ПолучитьОбъект();
			ОбъектШК.ПолныйКодМаркировки = СтруктураШтрихКодаМаркировки.ПолныйКодМаркировки;
			ОбъектШК.Записать();
			
		КонецЕсли;
		
		//-Белов А. 16.02.2026 #
	КонецЕсли;
	
	
	Возврат СтруктураШтрихКодаМаркировки;
	
КонецФункции

Функция РазложитьКодМаркировки(ПромШтрихКод, ЧастиКода) Экспорт
	
	ДанныеШтрихкода = Новый Структура("Результат, ШтрихКод, ПройденаПроверкаКраткогоКода, ШтрихКодКраткий, ШтрихКодПолный, ЧастиКода", Ложь, ПромШтрихКод, Ложь, "", "", ЧастиКода); 
	ДанныеШтрихкода.Вставить("ТекстОшибки", "");
	//+Марков И. 23.03.2026 #UT10-5779
	ПромШтрихКод_Очищенный = СтрЗаменить(ПромШтрихКод, Символ(29), "");
	ПровКод = ПромШтрихКод_Очищенный;
	//-Марков И. 23.03.2026 #UT10-5779
	
	//+Сёмин Р.И. 24.04.2026 #UT10-5814
	ИсходнаяДлинаПровКода = СтрДлина(ПровКод);
	//-Сёмин Р.И. 24.04.2026 #UT10-5814
	
	НачВремя = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекВремя = 0;
	
	Если Не ЧастиКода.Свойство("GS1") Тогда     
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет GS1");
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;
	
	Если ЧастиКода.Свойство("GS3") Тогда  
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Лишние GS");
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;
	
	// Проверка 01 
	ЕстьСкобки = Ложь;
	
	Если Лев(ПровКод, 2) = "01" Тогда     
		
		ЧастиКода.Вставить("S01", Лев(ПровКод, 2));   
		ПровКод = Сред(ПровКод, 3);   
		
	ИначеЕсли Лев(ПровКод, 4) = "(01)" Тогда     
		
		ЧастиКода.Вставить("S01", Лев(ПровКод, 4));    
		ПровКод = Сред(ПровКод, 5);   
		ЕстьСкобки = Истина;
		
	Иначе                       
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 01");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	//GTINGTINGTINGT21SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	ЧастиКода.Вставить("GTIN", Лев(ПровКод, 14));  
	ДанныеШтрихкода.Вставить("GTIN", Лев(ПровКод, 14));
	ПровКод = Сред(ПровКод, 15);   
	
	Если ПустаяСтрока(ПровКод) Тогда   
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Длина кода " + СтрДлина(ПромШтрихКод_Очищенный) + " меньше ожидаемой");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	//21SERIALSERIALSX91KEYKx92CRIPTOCRIPT...
	Если Лев(ПровКод, 2) = "21" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", Лев(ПровКод, 2));
		ПровКод = Сред(ПровКод, 3);   
		
	ИначеЕсли Лев(ПровКод, 4) = "(21)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S21", Лев(ПровКод, 4));
		ПровКод = Сред(ПровКод, 5);   
		
	Иначе         
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 21");
		Возврат ДанныеШтрихкода;
	КонецЕсли;
	
	//SERIALSERIALSx91KEYKx92CRIPTOCRIPT...
	//+Сёмин Р.И. 24.04.2026 #UT10-5814
	//ЧастиКода.Вставить("SERIAL", Лев(ПровКод, 13));
	//ПровКод = Сред(ПровКод, 14);
	
	Если Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Получить() Тогда
		
		ДлинаЧастиSERIAL = ПолучитьНомерПоследнегоСимволаКодаМаркировки(ПромШтрихКод) - (ИсходнаяДлинаПровКода - СтрДлина(ПровКод));
		
		Если ДлинаЧастиSERIAL <> Неопределено Тогда
			
			Если ДлинаЧастиSERIAL >= 6 И ДлинаЧастиSERIAL <= 20 Тогда
				
				ЧастиКода.Вставить("SERIAL", Лев(ПровКод, ДлинаЧастиSERIAL));
				ПровКод = Сред(ПровКод, ДлинаЧастиSERIAL + 1);
				
			Иначе
				
				ДанныеШтрихкода.Вставить("ТекстОшибки", "Некорректная длина части SERIAL");
				Возврат ДанныеШтрихкода;
				
			КонецЕсли;
			
		Иначе
			
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Не удалось выделить часть SERIAL");
			Возврат ДанныеШтрихкода;
			
		КонецЕсли;
		
	Иначе
		
		ЧастиКода.Вставить("SERIAL", Лев(ПровКод, 13));
		ПровКод = Сред(ПровКод, 14);
		
	КонецЕсли;
	//-Сёмин Р.И. 24.04.2026 #UT10-5814
	
	ДанныеШтрихкода.ШтрихКодКраткий = "01" + ЧастиКода.GTIN + "21" + ЧастиКода.SERIAL;
	ДанныеШтрихкода.ШтрихКодПолный  = "(01)" + ЧастиКода.GTIN + "(21)" + ЧастиКода.SERIAL;
	ДанныеШтрихкода.ПройденаПроверкаКраткогоКода = Истина;
	
	// Если указана константа РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ, то правильным считается только полный штрихкод
	Если ПустаяСтрока(ПровКод) Тогда   
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Короткий код. Нет 91, 93");
		Возврат ДанныеШтрихкода;
		
	КонецЕсли;
	
	//91KEYKx92CRIPTOCRIPT...    
	ЭтоКод93 = Истина;
	
	Если Лев(ПровКод, 2) = "91" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", Лев(ПровКод, 2));
		
		Поз91 = Найти(ПромШтрихКод_Очищенный, ПровКод);
		
		Если Не ЧастиКода.GS1 = Поз91 Тогда 
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 3); 
		ЭтоКод93 = Ложь;
		
	ИначеЕсли Лев(ПровКод, 4) = "(91)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S91", Лев(ПровКод, 4));
		
		Поз91 = Найти(ПромШтрихКод_Очищенный, ПровКод);
		
		Если Не ЧастиКода.GS1 = Поз91 Тогда  
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 5); 
		ЭтоКод93 = Ложь;   
		
	КонецЕсли;
	
	Если ЭтоКод93 Тогда
		
		//93KEYK    
		Если Лев(ПровКод, 2) = "93" И Не ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", Лев(ПровКод, 2));  
			Поз91 = Найти(ПромШтрихКод_Очищенный, ПровКод);
			
			Если (Не ЧастиКода.GS1 = Поз91 Или ЧастиКода.Свойство("GS2")) Тогда  
				ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
	           	Возврат ДанныеШтрихкода;
			КонецЕсли;
			
			ПровКод = Сред(ПровКод, 3); 
			
		ИначеЕсли Лев(ПровКод, 4) = "(93)" И ЕстьСкобки Тогда     
			
			ЧастиКода.Вставить("S93", Лев(ПровКод, 4));   
			Поз91 = Найти(ПромШтрихКод_Очищенный, ПровКод);
			
			Если (Не ЧастиКода.GS1 = Поз91 Или ЧастиКода.Свойство("GS2")) Тогда  
				ДанныеШтрихкода.Вставить("ТекстОшибки", "GS1 не в той позиции. Ожидаемая позиция " + Строка(Поз91));
	           	Возврат ДанныеШтрихкода;
			КонецЕсли;
			
			ПровКод = Сред(ПровКод, 5); 
			
		Иначе                      
			
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 91, 93");
			Возврат ДанныеШтрихкода;  
			
		КонецЕсли;                          
		
	КонецЕсли;
		
	Если Не ЧастиКода.Свойство("GS2") Тогда  
		
		Если ЭтоКод93 Тогда  
			ДанныеШтрихкода.Результат = Истина; 
		Иначе
			ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет GS2");
		КонецЕсли;
		
		Возврат ДанныеШтрихкода;  
		
	КонецЕсли;      
	
	//KEYKx92CRIPTOCRIPT... 
	ЧастиКода.Вставить("KEY", Лев(ПровКод, 4));   
	ПровКод = Сред(ПровКод, 5); 
	
	Если ПустаяСтрока(ПровКод) Тогда    
		
		ДанныеШтрихкода.Результат = Истина;     
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	//92CRIPTOCRIPT... 
	Если Лев(ПровКод, 2) = "92" И Не ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", Лев(ПровКод, 2));  
		
		Поз92 = Найти(ПромШтрихКод_Очищенный, ПровКод);
		
		Если Не ЧастиКода.GS2 = Поз92 Тогда    
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS2 не в той позиции. Ожидаемая позиция " + Строка(Поз92));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 3);  
		
	ИначеЕсли Лев(ПровКод, 4) = "(92)" И ЕстьСкобки Тогда     
		
		ЧастиКода.Вставить("S92", Лев(ПровКод, 4));  
		
		Поз92 = Найти(ПромШтрихКод_Очищенный, ПровКод);
		
		Если Не ЧастиКода.GS2 = Поз92 Тогда   
			ДанныеШтрихкода.Вставить("ТекстОшибки", "GS2 не в той позиции. Ожидаемая позиция " + Строка(Поз92));
           	Возврат ДанныеШтрихкода;
		КонецЕсли;
		
		ПровКод = Сред(ПровКод, 5); 
		
	Иначе               
		
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Нет 92");
		Возврат ДанныеШтрихкода;        
		
	КонецЕсли;
	
	//CRIPTOCRIPT... 
	Если СтрДлина(ПровКод) = 44 Или СтрДлина(ПровКод) = 88 Тогда
		
		ЧастиКода.Вставить("CRIPTO", ПровКод);
		ДанныеШтрихкода.Результат = Истина;
			
	Иначе
		ДанныеШтрихкода.Вставить("ТекстОшибки", "Неправильная длина криптохвоста: " + СтрДлина(ПровКод));
	КонецЕсли;
	
	Возврат ДанныеШтрихкода;
	
КонецФункции

Функция КодGS1ДляКомпонентыПечати(ПромШтрихКод) Экспорт
	
	//+Сёмин Р.И. 28.04.2026 #UT10-5814
	НомерПоследнегоСимволаКодаМаркировки = ПолучитьНомерПоследнегоСимволаКодаМаркировки(ПромШтрихКод);
	//-Сёмин Р.И. 28.04.2026 #UT10-5814
	
	ПромШтрихКод                   = СтрЗаменить(ПромШтрихКод , Символ(29) , "");
	ЗначениеШтрихКодаДляКомпоненты = СокрЛП(ПромШтрихКод);
	
	//Масла
	Если (Лев(ПромШтрихКод , 2) = "01" И Сред(ПромШтрихКод,17,2) = "21") Или (Лев(ПромШтрихКод , 4) = "(01)" И Сред(ПромШтрихКод,19,4) = "(21)") Тогда
		
		ПростойВидШтрихКода = Лев(ПромШтрихКод , 2) = "01";                
		
		//Получаем оба вида штрих-кода
		//+Сёмин Р.И. 28.04.2026 #UT10-5814
		//Если ПростойВидШтрихКода Тогда
		//	
		//	ЗначениеШтрихКодаДляКомпоненты = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
		//	КриптоХвост = СокрЛП(Сред(ПромШтрихКод , 32 , СтрДлина(ПромШтрихКод) - 31 ));
		//	
		//Иначе 
		//	
		//	ЗначениеШтрихКодаДляКомпоненты =  Лев(ПромШтрихКод , 35); 			
		//	КриптоХвост = СокрЛП(Сред(ПромШтрихКод , 36 , СтрДлина(ПромШтрихКод) - 35 ));
		//	
		//КонецЕсли;
		
		Если Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Получить() Тогда
			
			Если ПростойВидШтрихКода Тогда
				ЗначениеШтрихКодаДляКомпоненты = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , (НомерПоследнегоСимволаКодаМаркировки + 1) - 19);
			Иначе
				ЗначениеШтрихКодаДляКомпоненты =  Лев(ПромШтрихКод , НомерПоследнегоСимволаКодаМаркировки); 			
			КонецЕсли;
			
			КриптоХвост = СокрЛП(Сред(ПромШтрихКод , НомерПоследнегоСимволаКодаМаркировки + 1 , СтрДлина(ПромШтрихКод) - НомерПоследнегоСимволаКодаМаркировки ));
			
		Иначе
			
			Если ПростойВидШтрихКода Тогда
				
				ЗначениеШтрихКодаДляКомпоненты = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , 13);
				КриптоХвост = СокрЛП(Сред(ПромШтрихКод , 32 , СтрДлина(ПромШтрихКод) - 31 ));
				
			Иначе 
				
				ЗначениеШтрихКодаДляКомпоненты =  Лев(ПромШтрихКод , 35); 			
				КриптоХвост = СокрЛП(Сред(ПромШтрихКод , 36 , СтрДлина(ПромШтрихКод) - 35 ));
				
			КонецЕсли;
			
		КонецЕсли;
		//-Сёмин Р.И. 28.04.2026 #UT10-5814
		
		Если (Лев(КриптоХвост , 2) = "91" И Сред(КриптоХвост,7,2) = "92") Или (Лев(КриптоХвост , 4) = "(91)" И Сред(КриптоХвост,9,4) = "(92)") Тогда 
			
			ПростойВидКриптоХвоста  = Лев(КриптоХвост , 2) = "91"; 
			
			Если ПростойВидКриптоХвоста Тогда
				ЗначениеШтрихКодаДляКомпоненты = ЗначениеШтрихКодаДляКомпоненты + "(91)" + Сред(КриптоХвост,3,4) + "(92)" + Сред(КриптоХвост , 9 , СтрДлина(КриптоХвост) - 8);
			Иначе
				ЗначениеШтрихКодаДляКомпоненты = ЗначениеШтрихКодаДляКомпоненты + КриптоХвост; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ЗначениеШтрихКодаДляКомпоненты;

КонецФункции

Функция ПолучитьПозицииGS(Данные, СимволРазделитель, ВведеноВРучную)       
	
	ЧастиКода = Новый Структура;
	
	Если ВведеноВРучную Тогда
		
		//+Сёмин Р.И. 24.04.2026 #UT10-5814
		//ЧастиКода.Вставить("GS1", 32);
		//ЧастиКода.Вставить("GS2", 38);
		
		Данные = СтрЗаменить(Данные, ПолучитьСлужебныйСимволGS(), СимволРазделитель);
		//-Сёмин Р.И. 24.04.2026 #UT10-5814
				
	КонецЕсли;
	
	ДанныеПроверочные = Данные;
	
	Если Найти(ДанныеПроверочные, СимволРазделитель) = 0 Тогда
		Возврат ЧастиКода;
	КонецЕсли;  
	
	// Получение позиций GS в массив
	Поз = Найти(ДанныеПроверочные, СимволРазделитель);
	Сч = 1;
	
	Пока Поз > 0 Цикл
		
		ЧастиКода.Вставить("GS" + Строка(Сч), Поз); 
		ДанныеПроверочные = Лев(ДанныеПроверочные, Поз - 1) + Сред(ДанныеПроверочные, Поз + 1);
		
		Сч = Сч + 1;
		Поз = Найти(ДанныеПроверочные, СимволРазделитель);
	
	КонецЦикла;     
	
	Возврат ЧастиКода;

КонецФункции	
	
Функция ПроверкаВалидностьКодаМаркировки(СтруктураШтрихКодаМаркировки, МассивСостояний) Экспорт 
	
	Если Константы.ПроверятьСостояниеКодаВЧЗ.Получить() Тогда
		
		РезультатПроверкиКМ = ПроверитьСостояниеКМ(СтруктураШтрихКодаМаркировки.ШтрихКодКраткий);
		
		Если ЗначениеЗаполнено(РезультатПроверкиКМ.ТекстОшибки) Тогда
			Возврат РезультатПроверкиКМ.ТекстОшибки;	
		КонецЕсли;
		
		НайденноеЗначение = МассивСостояний.Найти(РезультатПроверкиКМ.СостояниеКМ);
		
		Если НайденноеЗначение = Неопределено Тогда
			Возврат "Состояние кода маркировки: " + РезультатПроверкиКМ.СостояниеКМ;	
		КонецЕсли;	
		
	КонецЕсли;	
		
	Если Константы.ПроверятьСоответствиеКодаТоваруПоGTIN.Получить() Тогда
		
		РезультатПроверкиКМ = ПроверкаСоответствиеПоGTIN(СтруктураШтрихКодаМаркировки);
		
		Если ЗначениеЗаполнено(РезультатПроверкиКМ.ТекстОшибки) Тогда
			Возврат РезультатПроверкиКМ.ТекстОшибки;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции	

Функция ПроверитьСостояниеКМ(КодМаркировки, 
	//+Шульман А. 06.03.2026 #UT10-5688	
	КоличествоПопыток = 1) Экспорт    
	//-Шульман А. 06.03.2026 #UT10-5688
	
	РезультатПроверкиКМ = Новый Структура("ТекстОшибки, СостояниеКМ, Действие", "", "", "");
	
	Метод = "/api/v1/km_info?orgId=" + Константы.ОсновнаяОрганизация.Получить().КодМДМГоловнойОрганизации;
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();    
	
	Если ПустаяСтрока(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;   
	
	Соединение = Новый HTTPСоединение(АдресСервиса,,,,,, );
	
	МассивКодов = Новый Массив;  
	МассивКодов.Добавить(КодМаркировки);     
	
	ПараметрыЗапроса = Новый Структура();  
	ПараметрыЗапроса.Вставить("codes", МассивКодов);     
	Отказ = Ложь;
	
	//+Шульман А. 06.03.2026 #UT10-5688
	Для А = 1 По КоличествоПопыток Цикл
	//-Шульман А. 06.03.2026 #UT10-5688
	
		Попытка

			СтрокаЗапроса = ОбщегоНазначения.ВернутьJSON(ПараметрыЗапроса);
			
			Заголовки = Новый Соответствие;  
			Заголовки.Вставить("Content-type", "application/json");
			//Заголовки.Вставить("Cache-Control", "no-cache");  
			
			HTTPЗапрос = Новый HTTPЗапрос();  
			HTTPЗапрос.АдресРесурса = Метод;
			HTTPЗапрос.Заголовки = Заголовки;     
			
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
	    	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			
		Исключение
			
			РезультатПроверкиКМ.ТекстОшибки = "Сервис ЧЗ недоступен";    // подробная ошибка записывается в ЖР 
			РезультатПроверкиКМ.Действие = "Обработать ошибку сервиса";   
			
			//+Шульман А. 06.03.2026 #UT10-5688
			//Возврат РезультатПроверкиКМ;     
			Если А = КоличествоПопыток Тогда  

				КМ = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(КодМаркировки, "");
				ЗаписьЖурналаРегистрации("Проверка состояния КМ. Сервис ЧЗ недоступен", УровеньЖурналаРегистрации.Ошибка, , КМ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
				
				Возврат РезультатПроверкиКМ;     
				
			Иначе
				
				// Пробуем еще раз после паузы
				РезультатПроверкиКМ.Действие = "";
				РезультатПроверкиКМ.ТекстОшибки = "";	
				AMQP_РаботаСДокументами.ПаузаИсполнения(2);
				
			КонецЕсли;
			//-Шульман А. 06.03.2026 #UT10-5688
		
		КонецПопытки;     
				
	КонецЦикла;
	
	//+Шульман А. 06.03.2026 #UT10-5688
	СообщениеСервиса = ""; 
	//-Шульман А. 06.03.2026 #UT10-5688
	
	Попытка
		
		ОтветJSONСтрока = Результат.ПолучитьТелоКакСтроку();
		
		Если ЗначениеЗаполнено(СокрЛП(ОтветJSONСтрока)) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветJSONСтрока);
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);	  
			
			//+Шульман А. 06.03.2026 #UT10-5688
			СтруктураДанных.Свойство("message", СообщениеСервиса); 
			//-Шульман А. 06.03.2026 #UT10-5688
			
		КонецЕсли;
		
	Исключение
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных";  
		Возврат РезультатПроверкиКМ;
		
	КонецПопытки;
	
	Если Не Результат.КодСостояния = 200 Тогда   
		
		//+Шульман А. 06.03.2026 #UT10-5688        
		КодСостояния = Результат.КодСостояния;
		
		Если ЗначениеЗаполнено(СообщениеСервиса) Тогда        
			
			КМ = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(КодМаркировки, "");
			СообщениеСервиса = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(СообщениеСервиса, "");
			ЗаписьЖурналаРегистрации("Проверка состояния КМ. Ошибка сервиса", УровеньЖурналаРегистрации.Ошибка, , КМ, СообщениеСервиса); 
			
			Если Найти(СообщениеСервиса, "404") > 0 Тогда
				КодСостояния = "404, код маркировки не найден в сервисе ЧЗ";
			КонецЕсли;
			
		КонецЕсли; 
		//-Шульман А. 06.03.2026 #UT10-5688
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при чтении данных. Код состояния " + КодСостояния;  
		Отказ = Истина;                        
		
	ИначеЕсли Не ЗначениеЗаполнено(ОтветJSONСтрока) Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Возвращено пустое тело по запросу";   
		Отказ = Истина;     
		
	КонецЕсли;
	
	Если Отказ Тогда
	
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
		
	Если Не СтруктураДанных.Свойство("list") Тогда
		
		РезультатПроверкиКМ.ТекстОшибки = "Ошибка при разборе JSON-данных";  
		Возврат РезультатПроверкиКМ;
		
	КонецЕсли;
	
	СоответствиеСтатусов = Новый Соответствие; 
	СоответствиеСтатусов.Вставить("EMITTED",     "Эмитирован");
	СоответствиеСтатусов.Вставить("APPLIED",     "Нанесён");
	СоответствиеСтатусов.Вставить("INTRODUCED",  "В обороте");
	СоответствиеСтатусов.Вставить("WRITTEN_OFF", "Списан");
	
	Для каждого ЭлементМассива Из СтруктураДанных.list Цикл
		
		Если КодМаркировки = ЭлементМассива.requestedCis Тогда
			
			мСостояниеКМ = СоответствиеСтатусов.Получить(ЭлементМассива.status);   
			РезультатПроверкиКМ.СостояниеКМ = ?(мСостояниеКМ = Неопределено, ЭлементМассива.status, мСостояниеКМ);
			
			//+Шульман А. 06.03.2026 #UT11-5688        
			РезультатПроверкиКМ.Вставить("producedDate",   ЭлементМассива.producedDate);  
			РезультатПроверкиКМ.Вставить("expirationDate", ЭлементМассива.expirationDate);
			//-Шульман А. 06.03.2026 #UT11-5688    
			
			//+Белов А. 15.05.2026 #
			РезультатПроверкиКМ.Вставить("ownerInn",   ЭлементМассива.ownerInn);  	
			//-Белов А. 15.05.2026 #
			
			Возврат РезультатПроверкиКМ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатПроверкиКМ.ТекстОшибки = "Нет переданного кода маркировки в полученных данных";  
	
	Возврат РезультатПроверкиКМ;

КонецФункции

Функция ПроверкаСоответствиеПоGTIN(СтруктураШтрихКодаМаркировки) Экспорт
	
	РезультатПроверкиКМ = Новый Структура("ТекстОшибки, Результат", "", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СправочникGTIN.Ссылка,
	|	СправочникGTIN.Владелец,
	|	СправочникGTIN.Владелец = &ТоварСсылка КАК ВладелецПроверен
	|ИЗ
	|	Справочник.GTIN КАК СправочникGTIN
	|ГДЕ
	|	СправочникGTIN.GTIN = &GTIN
	|	И НЕ СправочникGTIN.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВладелецПроверен УБЫВ";
	
	Запрос.УстановитьПараметр("GTIN", СтруктураШтрихКодаМаркировки.GTIN);
	Запрос.УстановитьПараметр("ТоварСсылка", СтруктураШтрихКодаМаркировки.Номенклатура);    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		РезультатПроверкиКМ.ТекстОшибки = "Товар по GTIN " + СтруктураШтрихКодаМаркировки.GTIN + " не найден в базе";
	Иначе                        
		
		Выборка = РезультатЗапроса.Выбрать();  
		Выборка.Следующий();
		
		Если Выборка.ВладелецПроверен Тогда
			РезультатПроверкиКМ.Результат = Истина;
		Иначе
			РезультатПроверкиКМ.ТекстОшибки = "Код маркировки не соответствует товару (проверка GTIN)";
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат РезультатПроверкиКМ;		
	
КонецФункции

Процедура ЗаписатьДатыКодаМаркировки(ШтрихКодноменклатуры, producedDate, expirationDate) Экспорт 
	
	//+Шульман А. 06.03.2026 #UT11-5688
	Если ПустаяСтрока(producedDate) И ПустаяСтрока(expirationDate) Тогда
		Возврат;
	КонецЕсли;  
	
	СпрОбъект = ШтрихКодноменклатуры.ПолучитьОбъект();     
	
	Если Не ПустаяСтрока(producedDate) Тогда
		СпрОбъект.ДатаПроизводства = МСК.СтрокаВДату(Лев(producedDate, 10));
	КонецЕсли;  
	
	Если Не ПустаяСтрока(expirationDate) Тогда
		СпрОбъект.СрокГодности = МСК.СтрокаВДату(Лев(expirationDate, 10));
	КонецЕсли;  
	
    СпрОбъект.Записать();    
    //-Шульман А. 06.03.2026 #UT11-5688

КонецПроцедуры

Процедура ЗаполнитьКраткийПолныйКодМаркировки(ПромШтрихКод, СтруктураШтрихКодаМаркировки, ПростойВидШтрихКода)
	
	//+Сёмин Р.И. 23.04.2026 #UT10-5814
	НомерПоследнегоСимволаКодаМаркировки = ПолучитьНомерПоследнегоСимволаКодаМаркировки(ПромШтрихКод);
	
	Если НомерПоследнегоСимволаКодаМаркировки = Неопределено Тогда
		
		СтруктураШтрихКодаМаркировки.ТекстОшибки = "Штрихкод не соответствует маске";
		СтруктураШтрихКодаМаркировки.Результат = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Если ПростойВидШтрихКода Тогда
		
		ПромШтрихКодКраткий = Лев(ПромШтрихКод , НомерПоследнегоСимволаКодаМаркировки);
		ПромШтрихКодПолный = "(01)" + Сред(ПромШтрихКод,3,14) + "(21)" + Сред(ПромШтрихКод , 19 , (НомерПоследнегоСимволаКодаМаркировки + 1) - 19);
		
	Иначе 
		
		ПромШтрихКодКраткий =  "01" + Сред(ПромШтрихКод,5,14) + "21" + Сред(ПромШтрихКод , 23 , (НомерПоследнегоСимволаКодаМаркировки + 1) - 23);
		ПромШтрихКодПолный = Лев(ПромШтрихКод , НомерПоследнегоСимволаКодаМаркировки);
		
	КонецЕсли;
	
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодКраткий", ПромШтрихКодКраткий);
	СтруктураШтрихКодаМаркировки.Вставить("ШтрихКодПолный", ПромШтрихКодПолный);
	//-Сёмин Р.И. 23.04.2026 #UT10-5814
	
КонецПроцедуры

Функция ПолучитьНомерПоследнегоСимволаКодаМаркировки(ПромШтрихКод)
	
	//+Сёмин Р.И. 24.04.2026 #UT10-5814
	НомерПоследнегоСимволаКодаМаркировки = Неопределено;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	
	//+Сёмин Р.И. 05.06.2026 #UT10-5911
	//RegExp.Pattern = "<?(GS)?>?" + Символ(29) + "?91.{4}<?(GS)?>?" + Символ(29) + "?92";
	// Маска: (<GS> или Символ(29)) + "91" + 4 символа + (<GS> или Символ(29)) + "92"
	RegExp.Pattern = "(<GS>|" + Символ(29) + ")91.{4}(<GS>|" + Символ(29) + ")92";
	//-Сёмин Р.И. 05.06.2026 #UT10-5911
	
	Matches = RegExp.Execute(ПромШтрихКод);
	
	ЧислоВхождений = Matches.Count();
	
	Если ЧислоВхождений > 0 Тогда
		НомерПоследнегоСимволаКодаМаркировки = Matches.Item(0).FirstIndex;
	Иначе
		
		//+Сёмин Р.И. 05.06.2026 #UT10-5911
		//RegExp.Pattern = "(<GS>)?" + Символ(29) + "?93.{4}(<GS>)?" + Символ(29) + "?";
		// Маска: (<GS> или Символ(29)) + "93" + 4 символа
		RegExp.Pattern = "(<GS>|" + Символ(29) + ")93.{4}";
		//-Сёмин Р.И. 05.06.2026 #UT10-5911
		
		Matches = RegExp.Execute(ПромШтрихКод);
		
		ЧислоВхождений = Matches.Count();
		
		Если ЧислоВхождений > 0 Тогда
			НомерПоследнегоСимволаКодаМаркировки = Matches.Item(0).FirstIndex;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НомерПоследнегоСимволаКодаМаркировки;
	//-Сёмин Р.И. 24.04.2026 #UT10-5814
	
КонецФункции

Функция ПолучитьСлужебныйСимволGS()
	
	//+Сёмин Р.И. 27.04.2026 #UT10-5814
	Возврат "<GS>";
	//-Сёмин Р.И. 27.04.2026 #UT10-5814
	
КонецФункции
